{
  "musicals": [
    {
      "id": 1,
      "image_url": "http://broadwaymusicalhome.com/images/poster/sweeney.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/sweeney.jpg",
      "title": "Sweeney Todd",
      "by": "Stephen Sondheim",
      "story": "Sweeney Todd, whose real name is Benjamin Barker, uses his new alias to resume work in his barber shop above Mrs. Lovett’s struggling pie shop after being wrongfully sentenced to life imprisonment by the corrupt Judge Turpin. After swearing vengeance against the judge that tore his family apart, Todd and Lovett plot a unique plan that helps them both and leads them down a dangerous, thrilling path with deadly consequences.",
      "theatre": "Uris Theatre",
      "opening night": "Mar 1, 1979",
      "total performances": "557",
      "original cast": "Victor Garber, Len Cariou, Merle Louise, Angela Lansbury, Edmund Lyndeck, Jack Eric Williams, Sarah Rice, Ken Jennings, Joaquin Romaguera, Robert Ousley",
      "director": "Harold Prince",
      "music_preview": ""
    },
    {
      "id": 2,
      "image_url": "http://broadwaymusicalhome.com/images/poster/rent.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/rent.jpg",
      "title": "Rent",
      "by": "Jonathan Larson",
      "story": "In the late 1980s and early 1990s, friends in Manhattan’s East Village struggle to build the lives of their dreams. Pennilessness, drug abuse, HIV/AIDS, social tension, and political unrest, among other hardships, challenge the group physically and emotionally. Facing the problems head on, they make personal self-discoveries and find what really matters most in life.",
      "theatre": "Nederlander Theatre",
      "opening night": "Apr 29, 1996",
      "total performances": "5,123",
      "original cast": "Taye Diggs, Wilson Jermaine Heredia, Jesse L. Martin, Idina Menzel, Adam Pascal, Anthony Rapp, Daphne Rubin-Vega, Fredi Walker",
      "director": "Micael Greif",
      "music_preview": ""
    },
    {
      "id": 3,
      "image_url": "https://broadwaymusicalhome.com/images/poster/saigon.jpg",
      "imagecard_url": "https://broadwaymusicalhome.com/images/banner/saigon.jpg",
      "title": "Miss Saigon",
      "by": "Claude-Michel Schönberg",
      "story": "The Vietnam War is in its final days, and American soldiers are celebrating in careless escapades with Saigon’s prostitutes. Chris, a sergeant with a distaste for the club scene, is coerced to spend the night with a new bargirl, Kim. When they quickly fall in love and Chris bargains for her freedom from the bar owner, named the Engineer, a love saga begins that puts the characters’ moral convictions and honor codes to the test.",
      "theatre": "Broadway Theatre",
      "opening night": "Apr 11, 1991",
      "total performances": "4,092",
      "original cast": "Hinton Battle, Barry K. Bernal, Liz Callaway, Kam Cheng, Willy Falk, Jonathan Pryce, Lea Salonga, Kam Cheng, Zar Acayan, Alan Ariano, Tony C. Avanti, Brian R. Baldomero, Jane Bodle, Raquel C. Brown, Annette Calud, Eric Chan, Marina Chapa, Mirla Criste, Francis J. Cruz, Imelda de los Reyes, Paul Dobie, Michael Gruber, JoAnn M. Hunter, Sala Iwamatsu, Leonard Joseph, Philip Lyle Kong, Darren Lee, Jason Ma, Paul Matsumoto, Sean McDermott, Thomas James O'Leary, Gordon Owens, Christopher Pecaro, Matthew Pedersen, Kris Phillips, W. Ellis Porter, Ray Santos, Jade Kaiwalani Stice, Melanie Mariko Tojio, Alton F. White, Nephi Jay Wimmer, Bruce Winant",
      "director": "Nicholas Hytner",
      "music_preview": ""
    },
    {
      "id": 4,
      "image_url": "http://broadwaymusicalhome.com/images/poster/matilda.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/matilda.jpg",
      "title": "Matilda",
      "by": "Tim Minchin and Dennis Kelly",
      "story": "Young Matilda loves to read and has a thirst for knowledge, but is treated poorly by her uncaring and self-absorbed parents. When she meets her kind, empathetic teacher Miss Honey, Matilda is encouraged to embrace her uniqueness and reach for the stars - a lesson that gives her the confidence to stand up to the school’s cruel headmistress, Miss Trunchbull. It is in the face of seemingly insurmountable odds and overwhelming degradation that Matilda finds her inner power, inspiring her teacher and her classmates to shake the oppressive yolks of the powerful.",
      "theatre": "Shubert Theatre",
      "opening night": "April 11, 2013",
      "total performances": "1,555",
      "original cast": "Sophia Gennusa, Oona Laurence, Bailey Ryon, Milly Shapiro, Bertie Carvel, Gabriel Ebert, Lauren Ward, Lesli Margherita, Karen Aldridge",
      "director": "Matthew Warchus",
      "music_preview": "https://itunes.apple.com/us/album/matilda-musical-original-broadway/id715017813?ign-mpt=uo%3D8"
    },
    {
      "id": 5,
      "image_url": "http://broadwaymusicalhome.com/images/poster/mormon.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/mormon.jpg",
      "title": "The Book of Mormon",
      "by": "Trey Parker, Matt Stone and Robert Lopez",
      "story": "Elder Price and Elder Cunningham, evangelists of the The Church of Jesus Christ of Latter-day Saints, are assigned to spread Mormonism in Uganda. Though they struggle with cultural differences, their own social oddities, and their inadequate knowledge of actual Mormonism, they commit to helping the Ugandans find the road to salvation - whatever that means.",
      "theatre": "Eugene O'Neil",
      "opening night": "March 24, 2011",
      "total performances": "Currently Running",
      "original cast": "Scott Barnhardt, Justin Bohon, Darlesia Cearcy, Lewis Cleale, Kevin Duda, Josh Gad, Asmeret Ghebremichael, Nikki M. James, Clark Johnsen, Rory O'Malley, John Eric Parker, Michael Potts, Andrew Rannells, Benjamin Schrader, Michael James Scott, Brian Sears, Jason Michael Snow, Lawrence Stallings, Brian Tyree, Rema Webb, Maia Nkenge Wilson, Tommar Wilson",
      "director": "Casey Nicholaw and Trey Parker",
      "music_preview": "https://itunes.apple.com/us/album/the-book-of-mormon-original-broadway-cast-recording/1270791564"
    },
    {
      "id": 6,
      "image_url": "http://broadwaymusicalhome.com/images/poster/west.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/west-side.jpg",
      "title": "West Side Story",
      "by": "Leonard Bernstein, Stephen Sondheim and Arthur Laurents",
      "story": "When Tony goes to support the Jets at a school dance he meets Maria, the sister of the Shark's leader, Bernardo, and falls in love. They dream of overcoming their differences, but gang violence makes it impossible for them to live happily ever after.",
      "theatre": "Winter Garden Theatre, Broadway Theatre",
      "opening night": "Sep 26, 1957",
      "total performances": "732",
      "original cast": "Mickey Calin, Larry Kert, Carol Lawrence, Ken Le Roy, Chita Rivera, Art Smith, Lee Becker, Grover Dale, Arch Johnson, Tony Mordente, Eddie Roll, David Winters, Tommy Abbott, William Bramley, Hank Brunjes, Erne Castaldo, Martin Charnin, Marilyn Cooper, Wilma Curley, Carole D'Andrea, Al De Sio, Marilyn D'Honau, Gene Gavin, Frank Green, Reri Grist, Carmen Gutierrez, John Harkins, Lowell Harris, Ronnie Lee, George Marcy, Jack Murray, Jay Norman, Julie Oser, Liane Plane, Nanette Rosen, Lynn Ross, Jamie Sanchez, Noel Schwartz, Elizabeth Taylor",
      "director": "Jerome Robbins",
      "music_preview": "https://itunes.apple.com/us/album/west-side-story-original-broadway/id186302499?ign-mpt=uo%3D8"
    },
    {
      "id": 7,
      "image_url": "http://broadwaymusicalhome.com/images/poster/phantom.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/alt/phantom.jpg",
      "title": "The Phantom of the Opera",
      "by": " Andrew Lloyd Webber, Charles Hart and Richard Stilgoe",
      "story": "It is 1881, and the backdrop in the notoriously haunted Opéra Populaire has just mysteriously fallen during rehearsal, frightening the star performer from continuing with the show and forcing young Christine to be recast in the role. After opening the production, the Phantom abducts Christine and brings her to his lair and reveals his love for her. When the Phantom discovers that Christine is already in love with Raoul, he vows to destroy him - a promise that leads both him and Christine to a dramatic discovery of the true power of music and love.",
      "theatre": "Majestic Theatre",
      "opening night": "Jan 26, 1988",
      "total performances": "unknown",
      "original cast": "Sarah Brightman, Michael Crawford, Steve Barton, Patti Cohenour, Cris Groenendaal, Elisa Heinsohn, Judy Kaye, Leila Martin, David Romano, Nicholas Wyman, Jeff Keller, Peter Kevoian, Barry McNabb, Beth McVey, Richard Warren Pugh, Philip Steele, Kenneth H. Waller",
      "director": "Harold Prince",
      "music_preview": "https://itunes.apple.com/us/album/phantom-opera-original-cast/id402530?ign-mpt=uo%3D8"
    },
    {
      "id": 8,
      "image_url": "http://broadwaymusicalhome.com/images/poster/wicked.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/wicked.jpg",
      "title": "Wicked",
      "by": "Stephen Schwartz and Winnie Holzman",
      "story": "Elphaba, born with unnatural green skin, is reviled by her father and endures a pitiful childhood. At Shiz University, she bonds with and befriends her popular roommate Galinda. When the two girls receive academic commendations and a chance to meet the Wizard of Oz, they eagerly accept. Soon, they begin to understand that the Wizard is the mastermind behind the political movement Elphaba has vocally opposed. Galinda accepts the Wizard’s charge to advance his interests while Elphaba leaves the university and her old friend to fight for what she believes is right.",
      "theatre": "George Gershwin Theatre",
      "opening night": "Oct 30, 2003",
      "total performances": "unknown",
      "original cast": "Kristin Chenoweth, Idina Menzel, Norbert Leo Butz, Michelle Federer, Christopher Fitzgerald, Joel Grey, Carole Shelley, William Youmans, Ioana Alfonso, Ben Cameron, Cristy Candler, Kristy Cates, Melissa Bell Chait, Marcus Choi, Kristoffer Cusick, Kathy Deitch, Melissa Fahn, Rhett G. George, Manuel Herrera, Kisha Howard, LJ Jellison, Sean McCourt, Corinne McFadden, Jan Neuberger, Walter Winston Oneil, Andrew Palermo, Andy Pellick, Michael Seelbach, Lorna Ventura, Derrick Williams",
      "director": "Joe Mantello",
      "music_preview": "https://itunes.apple.com/us/album/wicked-original-broadway-cast/id4426862?ign-mpt=uo%3D4"
    },
    {
      "id": 9,
      "image_url": "http://broadwaymusicalhome.com/images/poster/lesmis.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/alt/lesmis.jpg",
      "title": "Les Miserables",
      "by": "Alain Boublil, Claude-Michel Schönberg and Herbert Kretzmer",
      "story": "Jean Valjean, a French peasant and convicted thief, is freed from jail by a kind bishop and makes the most of the opportunity, changing his name and eventually becoming a factory owner and Mayor. When Valjean’s criminal past is resurrected and the Chief of Police, Javert, vows to bring him to justice, Valjean is forced to give up everything he has worked for and flee. Before doing so, he promises Fantine, a former worker on her death-bed, that he’ll find and care for her daughter Cosette. Years later, Valjean has cared for Cosette as a father, Javert seeks him still, and the city of Paris is torn by revolutionaries. Political and personal stories become intertwined, and all are called to question their devotion to freedom, love, and justice.",
      "theatre": "Broadway Theatre, Imperial Theatre",
      "opening night": "Mar 12, 1987",
      "total performances": "6,680",
      "original cast": "David Bryant, Leo Burmester, Jennifer Butt, Braden Danner, Randy Graff, Judy Kuhn, Michael Maguire, Terrence Mann, Chrissie McDonald, Frances Ruffelle, Donna Vivino, Colm Wilkinson",
      "director": "Trevor Nunn and John Caird",
      "music_preview": "https://itunes.apple.com/us/album/les-mis%C3%A9rables-original-broadway-cast-recording/1081609832"
    },
    {
      "id": 10,
      "image_url": "http://broadwaymusicalhome.com/images/poster/billy.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/alt/billy.jpg",
      "title": "Billy Elliot ",
      "by": "Elton John and Lee Hall",
      "story": "Billy is a motherless eleven-year-old boy in northeast England during the miners’ strike of 1984-85 - a difficult time for miners like his father and brother. Attracted to the grace of ballet, Billy leaves his boxing class to begin taking dance lessons. When his father finds out and forbids them, he begins taking secret private lessons with Mrs. Wilkinson, who believes he has the talent to be accepted into the Royal Ballet School in London. As Billy’s hopes and dreams grow bigger and the strike escalates, the family and the community are both challenged to consider and fight for that which is truly most important.",
      "theatre": "Imperial Theatre",
      "opening night": "Nov 13, 2008",
      "total performances": "1,312",
      "original cast": "David Alvarez, Santino Fontana, Haydn Gwynne, Gregory Jbara, Trent Kowalik, Kiril Kulish, Carole Shelley, Juliette Allen Angelo, Kevin Bernard, David Bologna, Grady McLeod Bowman, Heather Burns, Frank Dolce, Eboni Edwards, Darrell Grand Moultrie, Eric Gunhus, Meg Guzulescu, Stephen Hanna, Izzy Hanson-Johnston, Joel Hatch, Leah Hocking, Keean Johnson, Aaron Kaburick, Donnie Kehr, Jeff Kready, Stephanie Kurtzuba, David Larsen, Caroline London, Merle Louise, Marina Micalizzi, Mitchell Michaliszyn, Matthew Mindler, Tessa Netting, Daniel Oreskes, Jayne Paterson, Thommie Retter, Corrieanne Stein, Jamie Torcellini, Grant Turner, Casey Whyland, Erin Whyland",
      "director": "Stephen Daldry"
    },
    {
      "id": 11,
      "image_url": "https://broadwaymusicalhome.com/images/poster/cabaret.jpg",
      "imagecard_url": "",
      "title": "Cabaret",
      "by": "John Kander, Fred Ebb and Joe Masteroff",
      "story": "Cliff Bradshaw, an American author working on a novel in Berlin, encounters Sally Bowles at the seedy Kit Kat Klub where she sings. When she is fired by the club’s owner, also her jealous boyfriend, she moves in with Cliff and the two fall in love. As the Nazis begin taking control of the German government, the atmosphere of the Kit Kat Klub and the lives of Cliff and Sally begin to change dramatically.",
      "theatre": "Broadhurst Theatre, Imperial Theatre, Broadway Theatre",
      "opening night": "Nov 20, 1966",
      "total performances": "1,165",
      "original cast": "Bert Convy, Jack Gilford, Jill Haworth, Lotte Lenya, Joel Grey, Peg Murray, Edward Winter",
      "director": "Harold Prince",
      "music_preview": "https://itunes.apple.com/us/album/billy-elliot-musical-original/id120955326?ign-mpt=uo%3D8"
    },
    {
      "id": 12,
      "image_url": "http://broadwaymusicalhome.com/images/poster/hairspray.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/hairspray.jpg",
      "title": "Hairspray",
      "by": " Marc Shaiman, Scott Wittman, Mark O'Donnell and Thomas Meehan",
      "story": "It’s 1962, and plump, big-haired teenager Tracy Turnblad dreams of dancing on the local teenage TV dance program. When she learns a few dance moves from her black friend Seaweed, her wish comes true and she becomes an instant local celebrity. Using her new-found fame, Tracy advocates for racial integration on the show - an uphill battle she has every intention of winning.",
      "theatre": "Neil Simon Theatre",
      "opening night": "Aug 15, 2002",
      "total performances": "2,642",
      "original cast": "Marossa Jaret Winokur, Harvey Fierstein, Laura Bell Bundy, Kerry Butler, Mary Bond Davis, Linda Hart, Dick Latessa, Matthew Morrison, Corey Reynolds, Clarke Thorell, Danelle Eugenia Wilson",
      "director": "Jack O'Brian",
      "music_preview": "https://itunes.apple.com/us/album/hairspray-original-broadway/id157356876?ign-mpt=uo%3D4"
    },
    {
      "id": 13,
      "image_url": "http://broadwaymusicalhome.com/images/poster/myfairlady.jpg",
      "imagecardurl": "http://broadwaymusicalhome.com/images/alt/myfairlady.jpg",
      "title": "My Fair Lady",
      "by": " Frederick Loewe and Alan Jay Lerner",
      "story": "Eliza Doolittle, a rough Cockney girl, meets Colonel Pickering and Henry Higgins in Covent Garden where she’s selling flowers. When Higgins remarks that he could help Eliza speak properly and raise her status in the community, Pickering challenges him to do so and Eliza takes him up on the offer. Though difficult and frustrating for both Eliza and Higgins at first, the lessons soon begin to work wonders, and produce results that neither predict.",
      "theatre": "Mark Hellinger Theatre, Broadhurst Theatre, Broadway Theatre",
      "opening night": "Mar 15, 1956",
      "total performances": "2,717",
      "original cast": "Rex Harrison, Julie Andrews, Stanly Holloway, Cathleen Nesbitt, Robert Coote, John Michael King, Christopher Hewett, Reid Shelton",
      "director": "Moss Hart",
      "music_preview": "https://itunes.apple.com/us/album/my-fair-lady-original-broadway/id285116400?ign-mpt=uo%3D4"
    },
    {
      "id": 14,
      "image_url": "http://broadwaymusicalhome.com/images/poster/legallyblonde.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/alt/legally.jpg",
      "title": "Legally Blonde",
      "by": "Nell Benjamin, Laurence O'Keefe and Heather Hach",
      "story": "When Delta Nu's president Elle Woods gets dumped, she decides to get 'serious' to win her boy back. But once at Harvard Law, she discovers the true power behind being legally blonde.",
      "theatre": "Palace Theatre",
      "opening night": "Apr 29, 2007",
      "total performances": "595",
      "original cast": "Laura Bell Bundy, Christian Borle, Orfeh, Richard H. Blake, Kate Shindle, Nikki Snelson, Michael Rupert",
      "director": "Jerry Mitchell",
      "music_preview": "https://itunes.apple.com/us/album/legally-blonde-musical-original-broadway-cast-recording/1270808926"
    },
    {
      "id": 15,
      "image_url": "http://broadwaymusicalhome.com/images/poster/lion.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/lionking.jpg",
      "title": "The Lion King",
      "by": "Elton John, Tim Rice, Roger Allers and Irene Mecchi",
      "story": "Mufasa is the king at Pride Rock and his son, Simba, is destined to take over the throne after him, but when Mufasa’s brother Scar hatches a plan to kill them both, the kingdom is thrown into turmoil. Though Scar’s plan succeeds in deposing Mufasa, young Simba lives and grows up with his friends Timon and Pumbaa, a meerkat and a warthog, in the jungle. One day, Simba encounters an old friend, Nala, and she convinces him to return to Pride Rock to claim the throne that is rightfully his and lead the kingdom back to order and prosperity.",
      "theatre": "New Amsterdam Theatre, Minskoff Theatre",
      "opening night": "Nov 13, 1997",
      "total performances": "unknown",
      "original cast": "Gina Breedlove, Kevin Cahoon, Max Casella, Tracy Nicole Chapman, Heather Headley, Geoff Hoyle, Scott Irby-Ranniar, Tsidii Le Loka, Stanley Wayne Mathis, Jason Raize, Tom Alan Robbins, Kajuana Shuford, John Vickery, Samuel E. Wright",
      "director": "Julie Taymor",
      "music_preview": "https://itunes.apple.com/us/album/lion-king-original-broadway/id156779968?ign-mpt=uo%3D8"
    },
    {
      "id": 16,
      "image_url": "http://broadwaymusicalhome.com/images/poster/chicago.jpg",
      "imagecard-url": "http://broadwaymusicalhome.com/images/alt/chicago.jpg",
      "title": "Chicago",
      "by": "John Kander, Fred Ebb and Bob Fosse",
      "story": "Roxie Hart is sent to prison for killing a man who tried to walk out on her. While in prison she meets Velma Kelly, a big-time vaudeville star with twice as much blood on her hands. The two vie for the same lawyer, Billy Flynn, to help win their freedom and play the public from prison to help win fame for when they’re finally free.",
      "theatre": "46th Street Theatre",
      "opening night": "Jun 3, 1975",
      "total performances": "936",
      "original cast": "Gwen Verdon, Chita Rivera, Jerry Orbach, Barney Martin, Mary McCarty, M. O'Haughey, Christopher Chadman",
      "director": "Bob Fosse",
      "music_preview": "https://itunes.apple.com/us/album/chicago-the-musical/id258631223?ign-mpt=uo%3D8"
    },
    {
      "id": 17,
      "image_url": "http://www.broadwaymusicalhome.com/images/poster/gypsy.jpg ",
      "imagecard_url": "http://www.broadwaymusicalhome.com/images/alt/gypsy.jpg",
      "title": "Gypsy",
      "by": "Jule Styne, Stephen Sondheim and Arther Laurents",
      "story": "Mama Rose is determined that her younger daughter June will have a successful career, but after June elopes, Mama turns all her attention on her older, less talented daughter, Loise, who eventually becomes a burlesque stripper named Gypsy Rose Lee.",
      "theatre": "Broadway Theatre, Imperial Theatre",
      "opening night": "May 21, 1959",
      "total performances": "702",
      "original cast": "Ethel Merman, Jack Klugman, Sandra Church, Lane Bradbury, Maria Karnilova, Paul Wallace, Jaqueline Mayro",
      "director": "Jerome Robbins",
      "music_preview": ""
    },
    {
      "id": 18,
      "image_url": "http://broadwaymusicalhome.com/images/poster/mary.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/poppins.jpg",
      "title": "Mary Poppins",
      "by": "Richard M. Sherman, Robert B. Sherman and Julian Fellowes",
      "story": "George and Winifred live at Number 17, Cherry Tree Lane with their misbehaved children, whose latest nanny has just quit with a fit. Enter Mary Poppins, the “practically perfect” nanny who teaches with magic and bonds with the children as no other nanny has. When Mary suddenly leaves the position, and Winifred hires George’s childhood nanny to take on the job, sending George and the children fleeing from the house, Mary becomes more valuable than ever. With patience, kindness, and a little bit of magic, Mary and her friend Bert help the family set things right - maybe more right than they’d ever been before.",
      "theatre": "New Amsterdam Theatre",
      "opening night": "Nov 16, 2006",
      "total performances": "2,619",
      "original cast": "Ashley Brown, Daniel H. Jenkins, Gavin Lee, Rebecca Luker, Jane Carr, Katherine Doherty, Kathryn Faughnan, Ruth Gottschall, Matthew Gumley, Henry Hodges, Michael McCarty, Cass Morgan, Delaney Moro, Mark Price, Alexander Scheitinger",
      "director": "Richard Eyre",
      "music_preview": "https://itunes.apple.com/us/album/mary-poppins-supercalifragilistic/id428573457?ign-mpt=uo%3D8"
    },
    {
      "id": 19,
      "image_url": "http://broadwaymusicalhome.com/images/poster/charlie-chocolate.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/charlie-chocolate.jpg",
      "title": " Charlie and the Chocolate Factory",
      "by": "Scott Wittman, Marc Shaiman and David Greig",
      "story": "When Charlie wins a golden ticket to the weird and wonderful Wonka Chocolate Factory, it's the chance of a lifetime to feast on the sweets he's always dreamed of. But beyond the gates astonishment awaits, as down the sugary corridors and amongst the incredible edible delights, the five lucky winners discover not everything is as sweet as it seems.",
      "theatre": "Lunt-Fontanne Theatre",
      "opening night": "Apr 23, 2017",
      "total performances": "305",
      "original cast": "Christian Borle, John Rubinstein, Emily Padgett, Kathy Fitzgerald, F. Michael Haynie, Ben Crawford, Emma Pfaeffle, Alan H. Green, Trista Dollison, Jackie Hoffman, Michael Wartella, Jake Ryan Flynn, Ryan Foust, Ryan Sell, Yesenia Ayala, Darius Barnes Colin Bradbury, Jared Bradshaw, Ryan Breslin, Kristy Cates, Madeleine Doherty, Paloma Garcia-Lee, Stephanie Gibson, Talya Groves, Cory Lingner, Elliot Mattox, Monette McKay, Kyle Taylor Parker, Paul Slade Smith, Stephen Carrasco, Kristin Piro, Amy Quanbeck, Michael Williams, Mikey Winslow",
      "director": "Jack O'Brien",
      "music_preview": "https://itunes.apple.com/us/album/charlie-chocolate-factory/id716855866?mt=1&app=music&ign-mpt=uo%3D8"
    },
    {
      "id": 20,
      "image_url": "http://broadwaymusicalhome.com/images/poster/fame.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/fame.jpg",
      "title": "Fame",
      "by": "Steve Margoshes, Jacques Levy and Jose Fernandez",
      "story": "At New York City's legendary High School for Performing Arts, Fame takes the audience through the highs, the lows, the romances and the ultimate triumphs of the star-struck pupils in their quest for success.",
      "theatre": "unknown",
      "opening night": "unknown",
      "total performances": "unknown",
      "original cast": "Gavin Creel, Jennifer Gambatese, Jose Restrepo, Natasha Rennalls, Dioni Michelle Collins, Amy Ehrlich, Regina Le Vert, Carl Tramon, Dwayne Chattman, Richard G. Rodgers, Kim Cea, William Linton, Nadine Isenegger, Robert Creighton",
      "director": "Drew Scott Harris"
    },
    {
      "id": 21,
      "image_url": "http://broadwaymusicalhome.com/images/poster/mamma.jpg",
      "imagecard-url": "http://broadwaymusicalhome.com/images/banner/mamma.jpg",
      "title": " Mamma Mia! ",
      "by": "Benny Andersson, Bjorn Ulvaeus and Catherine Johnson",
      "story": "Sophie is ready to get married to her fiancée Sky, except for one thing - she has never met her father and wants him present for the big day. She invites three men that she discovers in her mother’s diary and believes to be candidates, but when they all arrive, Sophie’s mother Donna becomes distressed. As Sophie, Sky, Donna, her friends, and the three potential fathers prepare for the big day, emotions run high and surprises abound.",
      "theatre": "Winter Garden Theatre",
      "opening night": "Oct 18, 2001",
      "total performances": "5,765",
      "original cast": "Louise Pitre, Karen Mason, David Keeley, Tina Maddigan, Judy Kaye, Joe Machota, Dean Nolen, Ken Marks, Tonya Doran, Sara Inbar, Mark Price, Michael B. Washington",
      "director": "Phyllida Lloyd"
    },
    {
      "id": 22,
      "image_url": "http://broadwaymusicalhome.com/images/poster/satnight.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/sat.jpg",
      "title": "Saturday Night Fever",
      "by": "The Bee Gees and Nik Cohn",
      "story": "Tony Manero is a Brooklyn youth who goes to the discotheque, where he is admired by Stephanie Mangano and rest of the disco's patrons and while escaping his worries.",
      "theatre": "Minskoff Theatre",
      "opening night": "Oct 21, 1999",
      "total performances": "501",
      "original cast": "James Carpinello, Paige Price, Orfeh, Paul Castree, Sean Palmer, Andy Blankenbuehler, Richard H.Blake, Bryan Batt, Casey Nicholaw, Suzanne Costallos",
      "director": "Arlene Phillips"
    },
    {
      "id": 23,
      "image_url": "http://broadwaymusicalhome.com/images/poster/waitress.jpg",
      "imagecard_url": "https://www.whatsonstage.com/s/wos-photos-production/133232.jpg",
      "title": "Waitress",
      "by": " Sara Bareilles and Jessie Nelson",
      "story": "Based on the 2007 film by the late Adrienne Shelly, Waitress follows Jenna, a pregnant waitress in the south trapped in an abusive marriage and looking for a happy ending. She finds relief—and potentially that happy ending—by making creatively titled pies and forming a romance with an unlikely newcomer.",
      "theatre": "Brooks Atkinson Theatre",
      "opening night": "Apr 24, 2016",
      "total performances": "unknown",
      "original cast": "Jessie Mueller, Nick Cordero, Eric Anderson, Christopher Fitzgerald, Drew Gehling, Kimiko Glenn, Dakin Matthews, Keala Settle, Charity Angél Dawson, Jeremy Morse, Stephanie Torns, Thay Floyd, Molly Hager, Aisha Jackson, Ragan Pharris, Ryan Vasquez",
      "director": "Diane Paulus"
    },
    {
      "id": 24,
      "image_url": "http://broadwaymusicalhome.com/images/poster/annie.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/alt/annie.jpg",
      "title": "Annie",
      "by": "Charles Strouse, Martin Charnin and Thomas Meehan",
      "story": "Little orphan Annie is taken from her orphanage, and the clutches of evil Miss Hannigan, to stay at billionaire Oliver Warbuck’s mansion for the holidays. When Annie wins the hearts of Warbucks and his staff, they set out on an epic mission to find Annie’s parents. Meanwhile, Miss Hannigan, in partnership with her brother Rooster and his girlfriend Lily, attempt to make some money out of this unique situation. The stories become intertwined as the lovable Annie’s story hits the national spotlight.",
      "theatre": "Alvin Theatre, ANTA Playhouse, Eugene O'Neill Theatre, Uris Theatre",
      "opening night": "Apr 21, 1977",
      "total performances": "2,377",
      "original cast": "Andrea McArdle, Dorothy Loudon, Reid Shelton, Sandy Faison, Robert Fitch, Barbara Erwin",
      "director": "Martin Charnin",
      "music_preview": "https://itunes.apple.com/us/album/annie-original-broadway-cast/id939941788?ign-mpt=uo%3D8"
    },
    {
      "id": 25,
      "image_url": "http://broadwaymusicalhome.com/images/poster/hamilton.jpg",
      "imagecard_url": "http://broadwaymusicalhome.com/images/banner/hamilton.jpg",
      "title": "Hamilton",
      "by": "Lin-Manuel Miranda",
      "story": "Alexander Hamilton, a bastard orphan, is an American on the outside. With his fierce patriotism and willing perseverance, though, he rises through the military and political ranks, becoming an indispensable ally for some of America’s most renowned early heros. His story includes such struggles as the young nation’s first sex scandal and a long-time rivalry with Aaron Burr, all en route to his becoming head of the nation’s Treasury.",
      "theatre": "Richard Rodgers Theatre",
      "opening night": "Aug 6, 2015",
      "total performances": "unknown",
      "original cast": "Lin-Manuel Miranda, Christopher Jackson, Leslie Odom Jr., Phillipa Soo, Anthony Ramos, Daveed Diggs, Jonathan Groff, Renée Elise Goldsberry, Jasmine Cephas Jones, Okieriete Onaodowan, Carleigh Bettiol, Andrew Chappelle, Ariana DeBose, Alysha Deslorieux, Sydney James Harcourt, Neil Haskell, Sasha Hutchings, Thayne Jasperson, Stephanie Klemons, Morgan Marcell, Emmy Raver-Lampan, Javier Munoz, Jon Rua, Austin Smith, Seth Stewart, Betsy Struxness, Ephraim Sykes and Voltaire Wade-Greene",
      "director": "Thomas Kail",
      "music_preview": "https://itunes.apple.com/fr/album/hamilton-original-broadway-cast-recording/1025210938?app=music&ign-mpt=uo%3D4"
    }
  ]
}
